# Hello DBMS+ : De SQL aux Empreintes Carbone
Ce notebook présente un parcours complet d'analyse de données, alliant **requêtes SQL**, **exploration de tables multiples**, et **calcul de l’empreinte carbone**.  
L'objectif est de démontrer comment exploiter différentes sources de données pour générer des **insights pertinents**, à la fois pour la compréhension des données mondiales et pour l'évaluation environnementale.

Le notebook est structuré en deux grandes parties :  
1. **Jobs SQL 1 à 9** : exploration, filtrage, agrégation et jointures sur plusieurs tables (`world`, `students`, `nobel`, `SomeCompany`, etc.), permettant de comprendre et manipuler les données de manière progressive et pédagogique.  
2. **Big Job : Empreinte Carbone** : analyse des données de consommation énergétique par pays et région, calcul des émissions de CO2, visualisations et estimation du nombre d’arbres nécessaires pour compenser ces émissions.

In [1]:
# Imports

# Manipulation et analyse de données
import pandas as pd
import numpy as np

# Visualisation
import matplotlib.pyplot as plt
import seaborn as sns

# Pour afficher les graphiques directement dans le notebook
%matplotlib inline

# SQL magic pour exécuter des requêtes directement dans les cellules
%load_ext sql


# formatage des DataFrames pour la lisibilité
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 100)
pd.set_option('display.float_format', '{:.2f}'.format)

## Exploration et Analyse de Données avec SQL

In [2]:
# connecteur Postgresql
%sql postgresql://postgres:5219--ZmId*@localhost:65432/postgres

### Job 7

#### Création du dataset Euro2012

In [3]:
# %%sql

# -- Suppression des tables si elles existent
# DROP TABLE IF EXISTS goal CASCADE;
# DROP TABLE IF EXISTS game CASCADE;
# DROP TABLE IF EXISTS eteam CASCADE;

# -- Création de la table GAME
# CREATE TABLE game (
#     id INTEGER,
#     mdate VARCHAR(12),
#     stadium VARCHAR(100),
#     team1 VARCHAR(100),
#     team2 VARCHAR(100)
# );

# -- Création de la table ETEAM
# CREATE TABLE eteam (
#     id VARCHAR(3),
#     teamname VARCHAR(50),
#     coach VARCHAR(50)
# );

# -- Création de la table GOAL
# CREATE TABLE goal (
#     matchid INTEGER NOT NULL,
#     teamid VARCHAR(3),
#     player VARCHAR(100),
#     gtime INTEGER NOT NULL,
#     PRIMARY KEY (matchid, gtime)
# );

# -- Insertion des données GAME (31 matchs)
# INSERT INTO game VALUES 
# (1001,'8 June 2012','National Stadium, Warsaw','POL','GRE'),
# (1002,'8 June 2012','Stadion Miejski (Wroclaw)','RUS','CZE'),
# (1003,'12 June 2012','Stadion Miejski (Wroclaw)','GRE','CZE'),
# (1004,'12 June 2012','National Stadium, Warsaw','POL','RUS'),
# (1005,'16 June 2012','Stadion Miejski (Wroclaw)','CZE','POL'),
# (1006,'16 June 2012','National Stadium, Warsaw','GRE','RUS'),
# (1007,'9 June 2012','Metalist Stadium','NED','DEN'),
# (1008,'9 June 2012','Arena Lviv','GER','POR'),
# (1009,'13 June 2012','Arena Lviv','DEN','POR'),
# (1010,'13 June 2012','Metalist Stadium','NED','GER'),
# (1011,'17 June 2012','Metalist Stadium','POR','NED'),
# (1012,'17 June 2012','Arena Lviv','DEN','GER'),
# (1013,'10 June 2012','PGE Arena Gdansk','ESP','ITA'),
# (1014,'10 June 2012','Stadion Miejski (Poznan)','IRL','CRO'),
# (1015,'14 June 2012','Stadion Miejski (Poznan)','ITA','CRO'),
# (1016,'14 June 2012','PGE Arena Gdansk','ESP','IRL'),
# (1017,'18 June 2012','PGE Arena Gdansk','CRO','ESP'),
# (1018,'18 June 2012','Stadion Miejski (Poznan)','ITA','IRL'),
# (1019,'11 June 2012','Donbass Arena','FRA','ENG'),
# (1020,'11 June 2012','Olimpiyskiy National Sports Complex','UKR','SWE'),
# (1021,'15 June 2012','Donbass Arena','UKR','FRA'),
# (1022,'15 June 2012','Olimpiyskiy National Sports Complex','SWE','ENG'),
# (1023,'19 June 2012','Donbass Arena','ENG','UKR'),
# (1024,'19 June 2012','Olimpiyskiy National Sports Complex','SWE','FRA'),
# (1025,'21 June 2012','National Stadium, Warsaw','CZE','POR'),
# (1026,'22 June 2012','PGE Arena Gdansk','GER','GRE'),
# (1027,'23 June 2012','Donbass Arena','ESP','FRA'),
# (1028,'24 June 2012','Olimpiyskiy National Sports Complex','ENG','ITA'),
# (1029,'27 June 2012','Donbass Arena','POR','ESP'),
# (1030,'28 June 2012','National Stadium, Warsaw','GER','ITA'),
# (1031,'1 July 2012','Olimpiyskiy National Sports Complex','ESP','ITA ');

# -- Insertion des données ETEAM (16 équipes)
# INSERT INTO eteam VALUES 
# ('POL','Poland','Franciszek Smuda'),
# ('RUS','Russia','Dick Advocaat'),
# ('CZE','Czech Republic','Michal Bílek'),
# ('GRE','Greece','Fernando Santos'),
# ('NED','Netherlands','Bert van Marwijk'),
# ('DEN','Denmark','Morten Olsen'),
# ('GER','Germany','Joachim Löw'),
# ('POR','Portugal','Paulo Bento'),
# ('ESP','Spain','Vicente del Bosque'),
# ('ITA','Italy','Cesare Prandelli'),
# ('IRL','Republic of Ireland','Giovanni Trapattoni'),
# ('CRO','Croatia','Slaven Bilic'),
# ('UKR','Ukraine','Oleh Blokhin'),
# ('SWE','Sweden','Erik Hamrén'),
# ('ENG','England','Roy Hodgson'),
# ('FRA','France','Laurent Blanc');

# -- Insertion des données GOAL (76 buts)
# INSERT INTO goal VALUES 
# (1001,'POL','Robert Lewandowski',17),
# (1001,'GRE','Dimitris Salpingidis',51),
# (1002,'RUS','Alan Dzagoev',15),
# (1002,'RUS','Alan Dzagoev',79),
# (1002,'RUS','Roman Shirokov',24),
# (1002,'RUS','Roman Pavlyuchenko',82),
# (1002,'CZE','Václav Pilar',52),
# (1003,'GRE','Theofanis Gekas',53),
# (1003,'CZE','Petr Jirácek',3),
# (1003,'CZE','Václav Pilar',6),
# (1004,'POL','Jakub Blaszczykowski',57),
# (1004,'RUS','Alan Dzagoev',37),
# (1005,'CZE','Petr Jirácek',72),
# (1006,'GRE','Giorgos Karagounis',45),
# (1007,'DEN','Michael Krohn-Dehli',24),
# (1008,'GER','Mario Gómez',72),
# (1009,'DEN','Nicklas Bendtner',41),
# (1009,'DEN','Nicklas Bendtner',80),
# (1009,'POR','Pepe (footballer born 1983)',24),
# (1009,'POR','Hélder Postiga',36),
# (1009,'POR','Silvestre Varela',87),
# (1010,'NED','Robin van Persie',73),
# (1010,'GER','Mario Gómez',24),
# (1010,'GER','Mario Gómez',38),
# (1011,'POR','Cristiano Ronaldo',28),
# (1011,'POR','Cristiano Ronaldo',74),
# (1011,'NED','Rafael van der Vaart',11),
# (1012,'DEN','Michael Krohn-Dehli',24),
# (1012,'GER','Lukas Podolski',19),
# (1012,'GER','Lars Bender',80),
# (1013,'ESP','Cesc Fàbregas',64),
# (1013,'ITA','Antonio Di Natale',61),
# (1014,'IRL','Sean St Ledger',19),
# (1014,'CRO','Mario Mandžukic',3),
# (1014,'CRO','Mario Mandžukic',49),
# (1014,'CRO','Nikica Jelavic',43),
# (1015,'ITA','Andrea Pirlo',39),
# (1015,'CRO','Mario Mandžukic',72),
# (1016,'ESP','Fernando Torres',4),
# (1016,'ESP','Fernando Torres',70),
# (1016,'ESP','David Silva',49),
# (1016,'ESP','Cesc Fàbregas',83),
# (1017,'ESP','Jesús Navas',88),
# (1018,'ITA','Antonio Cassano',35),
# (1018,'ITA','Mario Balotelli',90),
# (1019,'FRA','Samir Nasri',39),
# (1019,'ENG','Joleon Lescott',30),
# (1020,'UKR','Andriy Shevchenko',55),
# (1020,'UKR','Andriy Shevchenko',62),
# (1020,'SWE','Zlatan Ibrahimovic',52),
# (1021,'FRA','Jérémy Ménez',53),
# (1021,'FRA','Yohan Cabaye',56),
# (1022,'SWE','Glen Johnson (English footballer)',49),
# (1022,'SWE','Olof Mellberg',59),
# (1022,'ENG','Andy Carroll',23),
# (1022,'ENG','Theo Walcott',64),
# (1022,'ENG','Danny Welbeck',78),
# (1023,'ENG','Wayne Rooney',48),
# (1024,'SWE','Zlatan Ibrahimovic',54),
# (1024,'SWE','Sebastian Larsson',90),
# (1025,'POR','Cristiano Ronaldo',79),
# (1026,'GER','Philipp Lahm',39),
# (1026,'GER','Sami Khedira',61),
# (1026,'GER','Miroslav Klose',68),
# (1026,'GER','Marco Reus',74),
# (1026,'GRE','Georgios Samaras',55),
# (1026,'GRE','Dimitris Salpingidis',89),
# (1027,'ESP','Xabi Alonso',19),
# (1027,'ESP','Xabi Alonso',90),
# (1030,'GER','Mesut Özil',90),
# (1030,'ITA','Mario Balotelli',20),
# (1030,'ITA','Mario Balotelli',36),
# (1031,'ESP','David Silva',14),
# (1031,'ESP','Jordi Alba',41),
# (1031,'ESP','Fernando Torres',84),
# (1031,'ESP','Juan Mata',88);

# -- Vérification
# SELECT 'Tables créées avec succès!' AS status;
# SELECT 'Matchs' AS table_name, COUNT(*) AS nb_lignes FROM game
# UNION ALL
# SELECT 'Équipes' AS table_name, COUNT(*) AS nb_lignes FROM eteam
# UNION ALL
# SELECT 'Buts' AS table_name, COUNT(*) AS nb_lignes FROM goal;

In [4]:
%%sql
SELECT *
FROM game
LIMIT 3

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[(1001, '8 June 2012', 'National Stadium, Warsaw', 'POL', 'GRE'),
 (1002, '8 June 2012', 'Stadion Miejski (Wroclaw)', 'RUS', 'CZE'),
 (1003, '12 June 2012', 'Stadion Miejski (Wroclaw)', 'GRE', 'CZE')]

#### 1. Analyse des cardinalités - Base UEFA EURO 2012

#### Relation 1 : Eteam ←→ Game (plays in)

**0..* (côté Game)** : Une équipe participe à zéro ou plusieurs matchs

**1..1 (côté Eteam)** : Un match est joué par exactement une équipe pour chaque rôle (team1 ou team2)

---

#### Relation 2 : Game ←→ Goal (scored in)

**0..* (côté Goal)** : Un match contient zéro à plusieurs buts

**1..1 (côté Game)** : Un but est marqué dans exactement un match

---

#### Relation 3 : Eteam ←→ Goal (scored for)

**0..* (côté Goal)** : Une équipe marque zéro à plusieurs buts

**1..1 (côté Eteam)** : Un but est marqué par exactement une équipe

#### 2. Affichage du numéro de match et le nom du joueur pour tous les buts marqués par l'Allemagne

In [5]:
%%sql
SELECT 
matchid,
player
FROM goal
WHERE teamid = 'GER'

 * postgresql://postgres:***@localhost:65432/postgres
10 rows affected.

[(1008, 'Mario Gómez'),
 (1010, 'Mario Gómez'),
 (1010, 'Mario Gómez'),
 (1012, 'Lukas Podolski'),
 (1012, 'Lars Bender'),
 (1026, 'Philipp Lahm'),
 (1026, 'Sami Khedira'),
 (1026, 'Miroslav Klose'),
 (1026, 'Marco Reus'),
 (1030, 'Mesut Özil')]

#### 3. Affichage des colonnes id, stadium, team1, team2 pour le match dont l’id est 1012.

In [6]:
%%sql
SELECT 
id,
stadium,
team1,
team2
FROM game
WHERE id = 1012

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[(1012, 'Arena Lviv', 'DEN', 'GER')]

#### 4. Affichage player, teamid, stadium et mdate de chaque but allemand.

In [7]:
%%sql
SELECT 
go.player,
go.teamid,
ga.stadium
FROM goal go 
INNER JOIN game ga on (matchid=id)
WHERE go.teamid = 'GER'

 * postgresql://postgres:***@localhost:65432/postgres
10 rows affected.

[('Mario Gómez', 'GER', 'Arena Lviv'),
 ('Mario Gómez', 'GER', 'Metalist Stadium'),
 ('Mario Gómez', 'GER', 'Metalist Stadium'),
 ('Lars Bender', 'GER', 'Arena Lviv'),
 ('Lukas Podolski', 'GER', 'Arena Lviv'),
 ('Marco Reus', 'GER', 'PGE Arena Gdansk'),
 ('Miroslav Klose', 'GER', 'PGE Arena Gdansk'),
 ('Sami Khedira', 'GER', 'PGE Arena Gdansk'),
 ('Philipp Lahm', 'GER', 'PGE Arena Gdansk'),
 ('Mesut Özil', 'GER', 'National Stadium, Warsaw')]

#### 5. Affichage team1, team2 et player pour chaque but marqué par un joueur appelé Mario.

In [8]:
%%sql
SELECT 
ga.team1,
ga.team2,
go.player
FROM goal go 
INNER JOIN game ga on (matchid=id)
WHERE go.player LIKE '%Mario%'

 * postgresql://postgres:***@localhost:65432/postgres
9 rows affected.

[('GER', 'POR', 'Mario Gómez'),
 ('NED', 'GER', 'Mario Gómez'),
 ('NED', 'GER', 'Mario Gómez'),
 ('IRL', 'CRO', 'Mario Mandžukic'),
 ('IRL', 'CRO', 'Mario Mandžukic'),
 ('ITA', 'CRO', 'Mario Mandžukic'),
 ('ITA', 'IRL', 'Mario Balotelli'),
 ('GER', 'ITA', 'Mario Balotelli'),
 ('GER', 'ITA', 'Mario Balotelli')]

#### 6. Jointure de la table goal et la table eteam sur les clés id - teamid.

In [9]:
%%sql
SELECT 
*
FROM goal go
INNER JOIN eteam et ON go.teamid = et.id
LIMIT 3

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[(1004, 'POL', 'Jakub Blaszczykowski', 57, 'POL', 'Poland', 'Franciszek Smuda'),
 (1001, 'POL', 'Robert Lewandowski', 17, 'POL', 'Poland', 'Franciszek Smuda'),
 (1004, 'RUS', 'Alan Dzagoev', 37, 'RUS', 'Russia', 'Dick Advocaat')]

#### 7. Buts marqués dans les 10 premières minutes : joueur, équipe, coach et minute

In [10]:
%%sql
SELECT
    go.player,
    go.teamid,
    et.coach,
    go.gtime
FROM goal AS go
INNER JOIN eteam AS et
    ON go.teamid = et.id
WHERE go.gtime <= 10
ORDER BY go.gtime, go.teamid, go.player;

 * postgresql://postgres:***@localhost:65432/postgres
4 rows affected.

[('Mario Mandžukic', 'CRO', 'Slaven Bilic', 3),
 ('Petr Jirácek', 'CZE', 'Michal Bílek', 3),
 ('Fernando Torres', 'ESP', 'Vicente del Bosque', 4),
 ('Václav Pilar', 'CZE', 'Michal Bílek', 6)]

#### 8. Dates des matchs où l’équipe team1 était coachée par Fernando Santos

In [11]:
%%sql

SELECT
    ga.mdate,
    et.teamname
FROM game AS ga
INNER JOIN eteam AS et
    ON ga.team1 = et.id
WHERE et.coach = 'Fernando Santos'
ORDER BY ga.mdate;

 * postgresql://postgres:***@localhost:65432/postgres
2 rows affected.

[('12 June 2012', 'Greece'), ('16 June 2012', 'Greece')]

#### 9. Joueurs ayant marqué un but au National Stadium, Warsaw

In [12]:
%%sql

SELECT
    go.player
FROM goal AS go
INNER JOIN game AS ga
    ON go.matchid = ga.id
WHERE ga.stadium = 'National Stadium, Warsaw'
ORDER BY go.player;

 * postgresql://postgres:***@localhost:65432/postgres
9 rows affected.

[('Alan Dzagoev',),
 ('Cristiano Ronaldo',),
 ('Dimitris Salpingidis',),
 ('Giorgos Karagounis',),
 ('Jakub Blaszczykowski',),
 ('Mario Balotelli',),
 ('Mario Balotelli',),
 ('Mesut Özil',),
 ('Robert Lewandowski',)]

#### 10. Nombre total de buts marqués par équipe

In [13]:
%%sql

SELECT
    teamid,
    COUNT(*) AS total_buts
FROM goal
GROUP BY teamid
ORDER BY total_buts DESC;

 * postgresql://postgres:***@localhost:65432/postgres
16 rows affected.

[('ESP', 12),
 ('GER', 10),
 ('ITA', 6),
 ('POR', 6),
 ('ENG', 5),
 ('SWE', 5),
 ('RUS', 5),
 ('GRE', 5),
 ('CRO', 4),
 ('CZE', 4),
 ('DEN', 4),
 ('FRA', 3),
 ('UKR', 2),
 ('NED', 2),
 ('POL', 2),
 ('IRL', 1)]

#### 11. Nombre de buts marqués par stade

In [14]:
%%sql
SELECT
    ga.stadium,
    COUNT(go.matchid) AS nombre_buts
FROM game AS ga
INNER JOIN goal AS go
    ON ga.id = go.matchid
GROUP BY ga.stadium
ORDER BY nombre_buts DESC;

 * postgresql://postgres:***@localhost:65432/postgres
8 rows affected.

[('Olimpiyskiy National Sports Complex', 14),
 ('PGE Arena Gdansk', 13),
 ('National Stadium, Warsaw', 9),
 ('Arena Lviv', 9),
 ('Stadion Miejski (Wroclaw)', 9),
 ('Stadion Miejski (Poznan)', 8),
 ('Metalist Stadium', 7),
 ('Donbass Arena', 7)]

#### 12. Nombre de buts marqués par la France pour chaque match

In [15]:
%%sql
SELECT
    ga.id AS match_id,
    ga.mdate,
    COUNT(go.matchid) AS nb_buts_fra
FROM game AS ga
INNER JOIN goal AS go
    ON ga.id = go.matchid
WHERE go.teamid = 'FRA'
GROUP BY ga.id, ga.mdate
ORDER BY ga.mdate;

 * postgresql://postgres:***@localhost:65432/postgres
2 rows affected.

[(1019, '11 June 2012', 1), (1021, '15 June 2012', 2)]

### Job 8 Base de données *SomeCompany*

#### 1. Création de la base de données *SomeCompany*

In [16]:
%%sql

-- Table Departments

CREATE TABLE IF NOT EXISTS Departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(100) NOT NULL,
    department_head INT,  -- FK vers Employees.employee_id
    location VARCHAR(100)
);


-- Table Employees

CREATE TABLE IF NOT EXISTS Employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    birthdate DATE,
    position VARCHAR(50),
    department_id INT REFERENCES Departments(department_id)
);


-- Table Projects

CREATE TABLE IF NOT EXISTS Projects (
    project_id INT PRIMARY KEY,
    project_name VARCHAR(100) NOT NULL,
    start_date DATE,
    end_date DATE,
    department_id INT REFERENCES Departments(department_id)
);

 * postgresql://postgres:***@localhost:65432/postgres
Done.
Done.
Done.

[]

#### Insertion des données: **departments**

In [17]:
%%sql

INSERT INTO Departments (department_id, department_name, department_head, location)
VALUES
(1, 'IT', 11, 'Headquarters'),
(2, 'Project Management', 2, 'Branch Office West'),
(3, 'Human Resources', 6, 'Branch Office East');

 * postgresql://postgres:***@localhost:65432/postgres
(psycopg2.errors.UniqueViolation) ERREUR:  la valeur d'une clé dupliquée rompt la contrainte unique « departments_pkey »
DETAIL:  La clé « (department_id)=(1) » existe déjà.

[SQL: INSERT INTO Departments (department_id, department_name, department_head, location)
VALUES
(1, 'IT', 11, 'Headquarters'),
(2, 'Project Management', 2, 'Branch Office West'),
(3, 'Human Resources', 6, 'Branch Office East');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

#### Insertion des données: **employees**

In [18]:
%%sql

INSERT INTO Employees (employee_id, first_name, last_name, birthdate, position, department_id)
VALUES
(1, 'John', 'Doe', '1990-05-15', 'Software Engineer', 1),
(2, 'Jane', 'Smith', '1985-08-20', 'Project Manager', 2),
(3, 'Mike', 'Johnson', '1992-03-10', 'Data Analyst', 1),
(4, 'Emily', 'Brown', '1988-12-03', 'UX Designer', 1),
(5, 'Alex', 'Williams', '1995-06-28', 'Software Developer', 1),
(6, 'Sarah', 'Miller', '1987-09-18', 'HR Specialist', 3),
(7, 'Ethan', 'Clark', '1991-02-14', 'Database Administrator', 1),
(8, 'Olivia', 'Garcia', '1984-07-22', 'Marketing Manager', 2),
(9, 'Emilia', 'Clark', '1986-01-12', 'HR Manager', 3),
(10, 'Daniel', 'Taylor', '1993-11-05', 'Systems Analyst', 1),
(11, 'William', 'Lee', '1994-08-15', 'Software Engineer', 1);

 * postgresql://postgres:***@localhost:65432/postgres
(psycopg2.errors.UniqueViolation) ERREUR:  la valeur d'une clé dupliquée rompt la contrainte unique « employees_pkey »
DETAIL:  La clé « (employee_id)=(1) » existe déjà.

[SQL: INSERT INTO Employees (employee_id, first_name, last_name, birthdate, position, department_id)
VALUES
(1, 'John', 'Doe', '1990-05-15', 'Software Engineer', 1),
(2, 'Jane', 'Smith', '1985-08-20', 'Project Manager', 2),
(3, 'Mike', 'Johnson', '1992-03-10', 'Data Analyst', 1),
(4, 'Emily', 'Brown', '1988-12-03', 'UX Designer', 1),
(5, 'Alex', 'Williams', '1995-06-28', 'Software Developer', 1),
(6, 'Sarah', 'Miller', '1987-09-18', 'HR Specialist', 3),
(7, 'Ethan', 'Clark', '1991-02-14', 'Database Administrator', 1),
(8, 'Olivia', 'Garcia', '1984-07-22', 'Marketing Manager', 2),
(9, 'Emilia', 'Clark', '1986-01-12', 'HR Manager', 3),
(10, 'Daniel', 'Taylor', '1993-11-05', 'Systems Analyst', 1),
(11, 'William', 'Lee', '1994-08-15', 'Software Engineer', 1);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

#### 4. Insertion d'employés dans la table employees

In [19]:
%%sql

INSERT INTO Employees (employee_id, first_name, last_name, birthdate, position, department_id)
VALUES
(12, 'Sophia', 'Baker', '1990-06-25', 'IT Manager', 2),
(13, 'Lucas', 'Martin', '1990-02-12', 'Software Engineer', 1),
(14, 'Chloe', 'Dubois', '1989-11-08', 'Project Manager', 2),
(15, 'Hugo', 'Moreau', '1992-07-21', 'Data Analyst', 1),
(16, 'Lea', 'Petit', '1991-05-05', 'UX Designer', 1),
(17, 'Antoine', 'Roux', '1988-09-30', 'Software Developer', 1),
(18, 'Camille', 'Lemoine', '1993-03-15', 'HR Specialist', 3);

 * postgresql://postgres:***@localhost:65432/postgres
(psycopg2.errors.UniqueViolation) ERREUR:  la valeur d'une clé dupliquée rompt la contrainte unique « employees_pkey »
DETAIL:  La clé « (employee_id)=(12) » existe déjà.

[SQL: INSERT INTO Employees (employee_id, first_name, last_name, birthdate, position, department_id)
VALUES
(12, 'Sophia', 'Baker', '1990-06-25', 'IT Manager', 2),
(13, 'Lucas', 'Martin', '1990-02-12', 'Software Engineer', 1),
(14, 'Chloe', 'Dubois', '1989-11-08', 'Project Manager', 2),
(15, 'Hugo', 'Moreau', '1992-07-21', 'Data Analyst', 1),
(16, 'Lea', 'Petit', '1991-05-05', 'UX Designer', 1),
(17, 'Antoine', 'Roux', '1988-09-30', 'Software Developer', 1),
(18, 'Camille', 'Lemoine', '1993-03-15', 'HR Specialist', 3);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

#### 5. Récupération du nom et du poste de tous les employés

In [20]:
%%sql
SELECT first_name, 
last_name, 
position
FROM Employees;

 * postgresql://postgres:***@localhost:65432/postgres
18 rows affected.

[('Jane', 'Smith', 'Project Manager'),
 ('Mike', 'Johnson', 'Data Analyst'),
 ('Emily', 'Brown', 'UX Designer'),
 ('Alex', 'Williams', 'Software Developer'),
 ('Sarah', 'Miller', 'HR Specialist'),
 ('Ethan', 'Clark', 'Database Administrator'),
 ('Olivia', 'Garcia', 'Marketing Manager'),
 ('Emilia', 'Clark', 'HR Manager'),
 ('Daniel', 'Taylor', 'Systems Analyst'),
 ('William', 'Lee', 'Software Engineer'),
 ('Sophia', 'Baker', 'IT Manager'),
 ('Lucas', 'Martin', 'Software Engineer'),
 ('Chloe', 'Dubois', 'Project Manager'),
 ('Hugo', 'Moreau', 'Data Analyst'),
 ('Lea', 'Petit', 'UX Designer'),
 ('Antoine', 'Roux', 'Software Developer'),
 ('Camille', 'Lemoine', 'HR Specialist'),
 ('John', 'Doe', 'Senior Software Engineer')]

#### 6. Mise à jour du poste d'un employé

In [21]:
%%sql
UPDATE Employees
SET position = 'Senior Software Engineer'
WHERE employee_id = 1;

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[]

In [22]:
%%sql
SELECT *
FROM Employees
WHERE employee_id = 1;

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[(1, 'John', 'Doe', datetime.date(1990, 5, 15), 'Senior Software Engineer', 1)]

#### 7. Suppression d'un employé de la table Employees

In [47]:
%%sql
DELETE FROM Employees
WHERE employee_id = 2;

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[]

#### 8. Affichage du nom, département et du bureau de chaque employé

In [ ]:
%%sql
SELECT 
    e.first_name,
    e.last_name,
    d.department_name,
    d.location
FROM Employees e
JOIN Departments d
    ON e.department_id = d.department_id
ORDER BY e.last_name, e.first_name;

#### 9. les membres de l’équipe IT, le management et les ressources humaines.

In [48]:
%%sql
SELECT first_name, last_name, position
FROM Employees e
JOIN Departments d
    ON e.department_id = d.department_id
WHERE d.department_name = 'IT'
ORDER BY last_name, first_name;

 * postgresql://postgres:***@localhost:65432/postgres
11 rows affected.

[('Emily', 'Brown', 'UX Designer'),
 ('Ethan', 'Clark', 'Database Administrator'),
 ('John', 'Doe', 'Senior Software Engineer'),
 ('Mike', 'Johnson', 'Data Analyst'),
 ('William', 'Lee', 'Software Engineer'),
 ('Lucas', 'Martin', 'Software Engineer'),
 ('Hugo', 'Moreau', 'Data Analyst'),
 ('Lea', 'Petit', 'UX Designer'),
 ('Antoine', 'Roux', 'Software Developer'),
 ('Daniel', 'Taylor', 'Systems Analyst'),
 ('Alex', 'Williams', 'Software Developer')]

In [49]:
%%sql
SELECT first_name, last_name, position
FROM Employees e
JOIN Departments d
    ON e.department_id = d.department_id
WHERE d.department_name = 'Project Management'
ORDER BY last_name, first_name;

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('Sophia', 'Baker', 'IT Manager'),
 ('Chloe', 'Dubois', 'Project Manager'),
 ('Olivia', 'Garcia', 'Marketing Manager')]

In [50]:
%%sql
SELECT first_name, last_name, position
FROM Employees e
JOIN Departments d
    ON e.department_id = d.department_id
WHERE d.department_name = 'Human Resources'
ORDER BY last_name, first_name;

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('Emilia', 'Clark', 'HR Manager'),
 ('Camille', 'Lemoine', 'HR Specialist'),
 ('Sarah', 'Miller', 'HR Specialist')]

#### 10. Affichage les départements  dans l’ordre alphabétique, avec les managers respectifs de chaque département.

In [51]:
%%sql
SELECT 
    d.department_name,
    e.first_name || ' ' || e.last_name AS manager_name
FROM Departments d
LEFT JOIN Employees e
    ON d.department_head = e.employee_id
ORDER BY d.department_name;

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('Human Resources', 'Sarah Miller'),
 ('IT', 'William Lee'),
 ('Project Management', None)]

#### 11.réation d'un département

In [55]:
%%sql
INSERT INTO Departments (department_id, department_name, department_head, location) VALUES (4, 'Growth & Acquisition', 8, 'South Hub');

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[]

In [57]:
%%sql
INSERT INTO Employees (employee_id, first_name, last_name, birthdate, position, department_id)
VALUES
(21, 'Nolan', 'Perrin', '1989-04-17', 'Growth Analyst', 4),
(22, 'Maëlys', 'Charpentier', '1992-10-03', 'Acquisition Manager', 4),
(23, 'Yanis', 'Boulanger', '1991-06-25', 'Performance Marketing Specialist', 4),
(24, 'Clémence', 'Faure', '1987-01-14', 'Growth Operations Lead', 4),
(25, 'Théo', 'Marchand', '1993-09-09', 'SEO & Content Strategist', 4);

 * postgresql://postgres:***@localhost:65432/postgres
(psycopg2.errors.UniqueViolation) ERREUR:  la valeur d'une clé dupliquée rompt la contrainte unique « employees_pkey »
DETAIL:  La clé « (employee_id)=(21) » existe déjà.

[SQL: INSERT INTO Employees (employee_id, first_name, last_name, birthdate, position, department_id)
VALUES
(21, 'Nolan', 'Perrin', '1989-04-17', 'Growth Analyst', 4),
(22, 'Maëlys', 'Charpentier', '1992-10-03', 'Acquisition Manager', 4),
(23, 'Yanis', 'Boulanger', '1991-06-25', 'Performance Marketing Specialist', 4),
(24, 'Clémence', 'Faure', '1987-01-14', 'Growth Operations Lead', 4),
(25, 'Théo', 'Marchand', '1993-09-09', 'SEO & Content Strategist', 4);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

## %%sql
SELECT first_name, last_name, position
FROM Employees
WHERE department_id = 4;

#### 12 Projets
- **Création de la table**

In [62]:
%%sql
CREATE TABLE projets (
    project_id INT PRIMARY KEY,
    project_name VARCHAR(100),
    start_date DATE,
    end_date DATE,
    department_id INT,
    CONSTRAINT projects_department_id_fkey
        FOREIGN KEY (department_id)
        REFERENCES Departments(department_id)
);

 * postgresql://postgres:***@localhost:65432/postgres
Done.

[]

In [63]:
%%sql
INSERT INTO projets (project_id, project_name, start_date, end_date, department_id)
VALUES
-- Projets IT
(8,  'Cloud Cost Optimization',     '2024-04-01', '2024-10-31', 1),
(9,  'Identity & Access Management','2024-05-15', '2024-08-31', 1),
(10, 'Monitoring Platform Upgrade','2024-06-01', '2024-09-30', 1),

-- Projets Growth & Acquisition
(11, 'Referral Program Launch',     '2024-04-10', '2024-06-15', 4),
(12, 'Conversion Funnel Redesign',  '2024-05-01', '2024-07-31', 4),
(13, 'Marketing Automation Setup',  '2024-06-05', '2024-08-20', 4);

 * postgresql://postgres:***@localhost:65432/postgres
6 rows affected.

[]

In [64]:
%%sql
SELECT
    project_id,
    project_name,
    start_date,
    end_date,
    department_id
FROM projets
ORDER BY project_id;

 * postgresql://postgres:***@localhost:65432/postgres
6 rows affected.

[(8, 'Cloud Cost Optimization', datetime.date(2024, 4, 1), datetime.date(2024, 10, 31), 1),
 (9, 'Identity & Access Management', datetime.date(2024, 5, 15), datetime.date(2024, 8, 31), 1),
 (10, 'Monitoring Platform Upgrade', datetime.date(2024, 6, 1), datetime.date(2024, 9, 30), 1),
 (11, 'Referral Program Launch', datetime.date(2024, 4, 10), datetime.date(2024, 6, 15), 4),
 (12, 'Conversion Funnel Redesign', datetime.date(2024, 5, 1), datetime.date(2024, 7, 31), 4),
 (13, 'Marketing Automation Setup', datetime.date(2024, 6, 5), datetime.date(2024, 8, 20), 4)]

In [66]:
%%sql
WITH calendar AS (
    SELECT
        generate_series(
            DATE '2024-04-01',
            DATE '2024-10-31',
            INTERVAL '1 month'
        )::date AS month
),

projects_expanded AS (
    SELECT
        d.department_name,
        c.month
    FROM projets p
    JOIN departments d
        ON p.department_id = d.department_id
    JOIN calendar c
        ON c.month BETWEEN date_trunc('month', p.start_date)
                        AND date_trunc('month', p.end_date)
)

SELECT
    department_name,
    to_char(month, 'YYYY-MM') AS month,
    COUNT(*) AS active_projects
FROM projects_expanded
WHERE department_name IN ('IT', 'Growth & Acquisition')
GROUP BY department_name, month
ORDER BY department_name, month;

 * postgresql://postgres:***@localhost:65432/postgres
12 rows affected.

[('Growth & Acquisition', '2024-04', 1),
 ('Growth & Acquisition', '2024-05', 2),
 ('Growth & Acquisition', '2024-06', 3),
 ('Growth & Acquisition', '2024-07', 2),
 ('Growth & Acquisition', '2024-08', 1),
 ('IT', '2024-04', 1),
 ('IT', '2024-05', 2),
 ('IT', '2024-06', 3),
 ('IT', '2024-07', 3),
 ('IT', '2024-08', 3),
 ('IT', '2024-09', 2),
 ('IT', '2024-10', 1)]

#### Analyse de performances

In [65]:
SELECT
    d.department_name,
    COUNT(p.project_id) AS nb_projets,
    ROUND(AVG(p.end_date - p.start_date), 1) AS duree_moyenne_jours
FROM projets p
JOIN departments d
    ON p.department_id = d.department_id
WHERE d.department_name IN ('IT', 'Growth & Acquisition')
GROUP BY d.department_name;

IndentationError: unexpected indent (395617292.py, line 2)

## Big Job

### Nettoyage du fichier csv

#### Notes : 

1. **CSV et format**  
   - Encodage spécifique : `WIN1252`  
   - Délimiteur : `;`  
   - Ligne 143 complètement vide → problème d’import dans PostgreSQL  

2. **Séparation du dataset en deux tables**  
   - **Table `country`** → toutes les lignes avant `"World"` (noms de pays)  
   - **Table `world`** → ligne `"World"` + toutes les lignes régionales  

3. **Minuscule pour les noms**  
   - Tous les noms de pays sont stockés en minuscules (`LOWER(country)`) pour faciliter les futures requêtes  

4. **Colonnes des tables**  
   - `country` : colonnes → `country, coal, gas, oil, hydro, renewable, nuclear`  
   - `world` : colonnes → `region, coal, gas, oil, hydro, renewable, nuclear`

In [23]:
# import des données du CSV dans un dataframe pandas
csv_path= r"C:\Users\Paul-Emmanuel Buffe\Desktop\la_plateforme\travaux_la_plateforme\hello-dbms\data\raw\carbon-footprint-data.csv"
df =pd.read_csv(csv_path,delimiter=';', encoding= 'windows-1252') # Encodage spécifique

# Suppression des lignes vides
df.dropna(how='all', inplace=True) # on ne supprime que les lignes qui sont complètement vides

In [24]:
print(df.head(3))

   Country  Coal   Gas   Oil  Hydro  Renewable  Nuclear
0  Albania  0.00  0.00  0.00 100.00       0.00     0.00
1  Algeria  0.00 97.80  1.80   0.40       0.00     0.00
2   Angola  0.00  0.00 46.80  53.20       0.00     0.00

### Création des tables
**Table "original_raw"**

In [25]:
# %%sql
# CREATE TABLE IF NOT EXISTS original_raw
#     country VARCHAR(100),
#     coal NUMERIC NULL,
#     gas NUMERIC NULL,
#     oil NUMERIC NULL,
#     hydro NUMERIC NULL,
#     renewable NUMERIC NULL,
#     nuclear NUMERIC NULL
# );

In [26]:
# insertion des données depuis le df
# for i, row in df.iterrows():
#     sql= f"""
#             INSERT INTO original_raw (country, coal, gas, oil, hydro, renewable, nuclear)
#             VALUES ('{row['Country']}', '{row['Coal']}', '{row['Gas']}', '{row['Oil']}', '{row['Hydro']}', '{row['Renewable']}', '{row['Nuclear']}')
#           """
#     %sql {sql}

**Table "country"**

In [27]:
# %%sql
# CREATE TABLE IF NOT EXISTS country(
#     country VARCHAR(100),
#     coal NUMERIC NULL,
#     gas NUMERIC NULL,
#     oil NUMERIC NULL,
#     hydro NUMERIC NULL,
#     renewable NUMERIC NULL,
#     nuclear NUMERIC NULL
# );

In [28]:
# %%sql
# INSERT INTO country(country, coal, gas, oil, hydro, renewable, nuclear)
# SELECT 
#     LOWER(country), 
#     coal, 
#     gas, 
#     oil, 
#     hydro, 
#     renewable, 
#     nuclear
# FROM original_raw
# WHERE country NOT IN ('World', 'East Asia & Pacific', 'Europe & Central',
#                       'Latin America & Caribbean', 'Middle East & North Afrika',
#                       'North America', 'South Asia', 'Sub­Saharan Africa');

**Table "world"**

In [29]:
# %%sql
# CREATE TABLE IF NOT EXISTS world(
#     region VARCHAR(100),
#     coal NUMERIC NULL,
#     gas NUMERIC NULL,
#     oil NUMERIC NULL,
#     hydro NUMERIC NULL,
#     renewable NUMERIC NULL,
#     nuclear NUMERIC NULL
# );

In [30]:
# %%sql
# INSERT INTO world(region, coal, gas, oil, hydro, renewable, nuclear)
# SELECT LOWER(country), 
#         coal, 
#         gas, 
#         oil, 
#         hydro, 
#         renewable, 
#         nuclear
# FROM original_raw
# WHERE country IN ('World', 'East Asia & Pacific', 'Europe & Central',
#                       'Latin America & Caribbean', 'Middle East & North Afrika',
#                       'North America', 'South Asia', 'Sub­Saharan Africa');

**Vérification des tables crées**

In [31]:
%sql SELECT * FROM country LIMIT 3;

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('albania', Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0'), Decimal('0.0'), Decimal('0.0')),
 ('algeria', Decimal('0.0'), Decimal('97.8'), Decimal('1.8'), Decimal('0.4'), Decimal('0.0'), Decimal('0.0')),
 ('angola', Decimal('0.0'), Decimal('0.0'), Decimal('46.8'), Decimal('53.2'), Decimal('0.0'), Decimal('0.0'))]

In [32]:
%sql SELECT * FROM world LIMIT 3;

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('world', Decimal('40.7'), Decimal('21.6'), Decimal('4.1'), Decimal('16.2'), Decimal('6.0'), Decimal('10.6')),
 ('east asia & pacific', Decimal('60.6'), Decimal('13.5'), Decimal('2.2'), Decimal('15.0'), Decimal('4.2'), Decimal('3.8')),
 ('europe & central', Decimal('24.1'), Decimal('24.3'), Decimal('1.3'), Decimal('16.6'), Decimal('10.5'), Decimal('22.4'))]

### Préparation et analyse des sources d’énergie des pays pour l’étude des émissions de CO2

**Analyse des données au niveau mondial**

In [33]:
%%sql
WITH filtered AS (
  SELECT *
  FROM world
  WHERE region = 'world'
)
SELECT 'coal' AS source, coal AS value FROM filtered
UNION ALL
SELECT 'gas' AS source, gas AS value FROM filtered
UNION ALL
SELECT 'oil' AS source, oil AS value FROM filtered
UNION ALL
SELECT 'hydro' AS source, hydro AS value FROM filtered
UNION ALL
SELECT 'renewable' AS source, renewable AS value FROM filtered
UNION ALL
SELECT 'nuclear' AS source, nuclear AS value FROM filtered;

 * postgresql://postgres:***@localhost:65432/postgres
6 rows affected.

[('coal', Decimal('40.7')),
 ('gas', Decimal('21.6')),
 ('oil', Decimal('4.1')),
 ('hydro', Decimal('16.2')),
 ('renewable', Decimal('6.0')),
 ('nuclear', Decimal('10.6'))]

**Analyse des différents mix energétique des grands ensembles régionaux : Energies Fossiles VS Autres Energies**

In [34]:
%%sql
SELECT
    region,
    CEIL(gas + oil + coal) AS fossil_energie,
    ROUND(hydro + renewable + nuclear) AS others
FROM world WHERE region = 'world'
UNION ALL
SELECT*
FROM (SELECT 
region,
    (gas + oil + coal) AS fossil_energie,
    ROUND(hydro + renewable + nuclear) AS others
FROM world
ORDER BY 2 DESC LIMIT 1)
UNION ALL
SELECT*
FROM (SELECT 
region,
    (gas + oil + coal) AS fossil_energie,
    ROUND(hydro + renewable + nuclear) AS others
FROM world
ORDER BY 2 asc LIMIT 1)

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('world', Decimal('67'), Decimal('33')),
 ('middle east & north afrika', Decimal('96.3'), Decimal('3')),
 ('latin america & caribbean', Decimal('43.1'), Decimal('55'))]

**Régions du monde pour lesquelles le charbon rentre dans plus du quart de leur production d'electricité**

In [35]:
%%sql
SELECT 
    DISTINCT region,
    MAX(coal) AS max_coal
FROM world
WHERE 1=1
AND region NOT IN ('world')
AND coal > 25
group by 1
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:65432/postgres
4 rows affected.

[('south asia', Decimal('65.7')),
 ('east asia & pacific', Decimal('60.6')),
 ('sub\xadsaharan africa', Decimal('51.4')),
 ('north america', Decimal('35.7'))]

**Analyse de l'utilisation des énérgies dites "propres" par région.**

**Energies renouvelables:**

In [36]:
%%sql
SELECT 
    DISTINCT region,
    MAX(renewable) AS max_renewable
FROM world
WHERE region NOT IN ('world')
group by 1
ORDER BY 2 DESC
LIMIT 1

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[('europe & central', Decimal('10.5'))]

**Energie Nucléaire**

In [37]:
%%sql
SELECT 
    DISTINCT region,
    MAX(nuclear) AS max_nuclear
FROM world
WHERE region NOT IN ('world')
group by 1
ORDER by 2 DESC
LIMIT 1

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[('europe & central', Decimal('22.4'))]

**Energie Hydrolique**

In [38]:
%%sql
SELECT 
    region,
    MAX(hydro) AS max_hydro
FROM world
GROUP BY region
ORDER BY max_hydro DESC
LIMIT 1

 * postgresql://postgres:***@localhost:65432/postgres
1 rows affected.

[('latin america & caribbean', Decimal('46.5'))]

**Analyses des mix energétiques de la communanuté mondiale**

**Les pays avec plus de 66 % d'énergies dites propres**

In [39]:
%%sql
SELECT
country,
coal,
gas,
oil,
nuclear,
hydro,
renewable,
nuclear + hydro + renewable AS "total_energies_propres"
FROM country
WHERE nuclear + hydro + renewable >= 66
ORDER by 8 DESC

 * postgresql://postgres:***@localhost:65432/postgres
34 rows affected.

[('paraguay', Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0'), Decimal('0.0'), Decimal('100.0')),
 ('albania', Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0'), Decimal('0.0'), Decimal('100.0')),
 ('nepal', Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('99.8'), Decimal('0.2'), Decimal('100.0')),
 ('iceland', Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('71.0'), Decimal('28.9'), Decimal('99.9')),
 ('congo, dem. rep.', Decimal('0.0'), Decimal('0.1'), Decimal('0.0'), Decimal('0.0'), Decimal('99.9'), Decimal('0.0'), Decimal('99.9')),
 ('ethiopia', Decimal('0.0'), Decimal('0.0'), Decimal('0.1'), Decimal('0.0'), Decimal('95.6'), Decimal('4.3'), Decimal('99.9')),
 ('namibia', Decimal('0.0'), Decimal('0.0'), Decimal('0.9'), Decimal('0.0'), Decimal('99.1'), Decimal('0.0'), Decimal('99.1')),
 ('sweden', Decimal('0.6'), Decimal('0.3'), Decimal('0.2'), Decimal('42.3'), Decimal('41.5'), Decimal('14.3'), Decimal('98.1')),
 ('norway', Decimal('0.1'), Decimal('1.8'), Decimal('0.0'), Decimal('0.0'), Decimal('96.0'), Decimal('1.7'), Decimal('97.7')),
 ('switzerland', Decimal('0.0'), Decimal('0.7'), Decimal('0.1'), Decimal('39.3'), Decimal('54.3'), Decimal('3.8'), Decimal('97.4')),
 ('zambia', Decimal('0.0'), Decimal('0.0'), Decimal('2.8'), Decimal('0.0'), Decimal('97.2'), Decimal('0.0'), Decimal('97.2')),
 ('tajikistan', Decimal('0.0'), Decimal('2.9'), Decimal('0.0'), Decimal('0.0'), Decimal('97.1'), Decimal('0.0'), Decimal('97.1')),
 ('france', Decimal('2.2'), Decimal('2.3'), Decimal('0.3'), Decimal('78.4'), Decimal('11.3'), Decimal('5.1'), Decimal('94.8')),
 ('kyrgyz republic', Decimal('7.4'), Decimal('0.8'), Decimal('0.6'), Decimal('0.0'), Decimal('91.3'), Decimal('0.0'), Decimal('91.3')),
 ('mozambique', Decimal('0.0'), Decimal('8.8'), Decimal('0.0'), Decimal('0.0'), Decimal('91.2'), Decimal('0.0'), Decimal('91.2')),
 ('uruguay', Decimal('0.0'), Decimal('0.0'), Decimal('9.1'), Decimal('0.0'), Decimal('74.2'), Decimal('16.8'), Decimal('91.0')),
 ('costa rica', Decimal('0.0'), Decimal('0.0'), Decimal('10.2'), Decimal('0.0'), Decimal('65.7'), Decimal('24.0'), Decimal('89.7')),
 ('togo', Decimal('0.0'), Decimal('0.0'), Decimal('12.0'), Decimal('0.0'), Decimal('84.5'), Decimal('3.5'), Decimal('88.0')),
 ('kenya', Decimal('0.0'), Decimal('0.0'), Decimal('18.5'), Decimal('0.0'), Decimal('35.8'), Decimal('45.7'), Decimal('81.5')),
 ('austria', Decimal('8.0'), Decimal('8.8'), Decimal('1.0'), Decimal('0.0'), Decimal('66.6'), Decimal('14.6'), Decimal('81.2')),
 ('georgia', Decimal('0.0'), Decimal('19.6'), Decimal('0.0'), Decimal('0.0'), Decimal('80.4'), Decimal('0.0'), Decimal('80.4')),
 ('slovak republic', Decimal('12.4'), Decimal('6.0'), Decimal('1.1'), Decimal('57.1'), Decimal('15.5'), Decimal('7.4'), Decimal('80.0')),
 ('canada', Decimal('9.9'), Decimal('9.4'), Decimal('1.2'), Decimal('16.4'), Decimal('58.3'), Decimal('4.5'), Decimal('79.2')),
 ('new zealand', Decimal('4.5'), Decimal('16.3'), Decimal('0.0'), Decimal('0.0'), Decimal('55.9'), Decimal('23.2'), Decimal('79.1')),
 ('sudan', Decimal('0.0'), Decimal('0.0'), Decimal('21.7'), Decimal('0.0'), Decimal('78.3'), Decimal('0.0'), Decimal('78.3')),
 ('brazil', Decimal('4.5'), Decimal('13.7'), Decimal('6.0'), Decimal('2.6'), Decimal('63.2'), Decimal('9.9'), Decimal('75.7')),
 ('slovenia', Decimal('21.9'), Decimal('2.2'), Decimal('0.2'), Decimal('37.1'), Decimal('35.5'), Decimal('3.0'), Decimal('75.6')),
 ('cameroon', Decimal('0.0'), Decimal('12.9'), Decimal('12.8'), Decimal('0.0'), Decimal('73.2'), Decimal('1.0'), Decimal('74.2')),
 ('colombia', Decimal('10.2'), Decimal('15.3'), Decimal('0.2'), Decimal('0.0'), Decimal('71.1'), Decimal('3.1'), Decimal('74.2')),
 ('croatia', Decimal('17.6'), Decimal('7.5'), Decimal('1.0'), Decimal('0.0'), Decimal('67.0'), Decimal('6.9'), Decimal('73.9')),
 ('finland', Decimal('17.4'), Decimal('8.1'), Decimal('0.3'), Decimal('34.6'), Decimal('19.7'), Decimal('18.9'), Decimal('73.2')),
 ('korea, dem. people’s rep.', Decimal('24.1'), Decimal('0.0'), Decimal('3.3'), Decimal('0.0'), Decimal('72.6'), Decimal('0.0'), Decimal('72.6')),
 ('guatemala', Decimal('17.3'), Decimal('0.0'), Decimal('14.1'), Decimal('0.0'), Decimal('45.2'), Decimal('23.4'), Decimal('68.6')),
 ('venezuela, rb', Decimal('0.0'), Decimal('17.7'), Decimal('14.0'), Decimal('0.0'), Decimal('68.3'), Decimal('0.0'), Decimal('68.3'))]

**Les pays avec plus de 66 % d'énergies fossiles**

In [40]:
%%sql
SELECT
country,
coal,
gas,
oil,
nuclear,
hydro,
renewable,
coal + gas + oil AS "total_energies_fossiles"
FROM country
WHERE coal + gas + oil >= 66
ORDER by 8 DESC

 * postgresql://postgres:***@localhost:65432/postgres
69 rows affected.

[('yemen, rep.', Decimal('0.0'), Decimal('38.6'), Decimal('61.4'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('qatar', Decimal('0.0'), Decimal('100.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('trinidad and tobago', Decimal('0.0'), Decimal('99.8'), Decimal('0.2'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('saudi arabia', Decimal('0.0'), Decimal('51.2'), Decimal('48.8'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('bahrain', Decimal('0.0'), Decimal('100.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('kuwait', Decimal('0.0'), Decimal('33.7'), Decimal('66.3'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('libya', Decimal('0.0'), Decimal('53.7'), Decimal('46.3'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('oman', Decimal('0.0'), Decimal('97.4'), Decimal('2.6'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('turkmenistan', Decimal('0.0'), Decimal('100.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('botswana', Decimal('95.8'), Decimal('0.0'), Decimal('4.2'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('brunei darussalam', Decimal('0.0'), Decimal('99.0'), Decimal('1.0'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0'), Decimal('100.0')),
 ('hong kong sar, china', Decimal('76.2'), Decimal('23.0'), Decimal('0.6'), Decimal('0.0'), Decimal('0.0'), Decimal('0.2'), Decimal('99.8')),
 ('united arab', Decimal('0.0'), Decimal('98.4'), Decimal('1.3'), Decimal('0.0'), Decimal('0.0'), Decimal('0.3'), Decimal('99.7')),
 ('jordan', Decimal('0.0'), Decimal('7.1'), Decimal('92.5'), Decimal('0.0'), Decimal('0.3'), Decimal('0.0'), Decimal('99.6')),
 ('south sudan', Decimal('0.0'), Decimal('0.0'), Decimal('99.6'), Decimal('0.0'), Decimal('0.0'), Decimal('0.4'), Decimal('99.6')),
 ('algeria', Decimal('0.0'), Decimal('97.8'), Decimal('1.8'), Decimal('0.0'), Decimal('0.4'), Decimal('0.0'), Decimal('99.6')),
 ('eritrea', Decimal('0.0'), Decimal('0.0'), Decimal('99.5'), Decimal('0.0'), Decimal('0.0'), Decimal('0.5'), Decimal('99.5')),
 ('benin', Decimal('0.0'), Decimal('0.0'), Decimal('99.5'), Decimal('0.0'), Decimal('0.0'), Decimal('0.5'), Decimal('99.5')),
 ('niger', Decimal('71.6'), Decimal('0.0'), Decimal('27.8'), Decimal('0.0'), Decimal('0.0'), Decimal('0.6'), Decimal('99.4')),
 ('belarus', Decimal('0.1'), Decimal('98.0'), Decimal('1.1'), Decimal('0.0'), Decimal('0.3'), Decimal('0.4'), Decimal('99.2')),
 ('lebanon', Decimal('0.0'), Decimal('0.0'), Decimal('98.9'), Decimal('0.0'), Decimal('1.1'), Decimal('0.0'), Decimal('98.9')),
 ('bangladesh', Decimal('2.0'), Decimal('82.0'), Decimal('14.7'), Decimal('0.0'), Decimal('1.1'), Decimal('0.3'), Decimal('98.7')),
 ('israel', Decimal('49.6'), Decimal('48.4'), Decimal('0.5'), Decimal('0.0'), Decimal('0.0'), Decimal('1.5'), Decimal('98.5')),
 ('kosovo', Decimal('96.9'), Decimal('0.0'), Decimal('0.3'), Decimal('0.0'), Decimal('2.8'), Decimal('0.0'), Decimal('97.2')),
 ('singapore', Decimal('1.1'), Decimal('95.3'), Decimal('0.7'), Decimal('0.0'), Decimal('0.0'), Decimal('1.7'), Decimal('97.1')),
 ('mongolia', Decimal('92.3'), Decimal('0.0'), Decimal('4.5'), Decimal('0.0'), Decimal('0.0'), Decimal('3.2'), Decimal('96.8')),
 ('malta', Decimal('0.0'), Decimal('0.0'), Decimal('96.7'), Decimal('0.0'), Decimal('0.0'), Decimal('3.3'), Decimal('96.7')),
 ('curacao', Decimal('0.0'), Decimal('0.0'), Decimal('96.4'), Decimal('0.0'), Decimal('0.0'), Decimal('3.6'), Decimal('96.4')),
 ('cuba', Decimal('0.0'), Decimal('14.4'), Decimal('81.6'), Decimal('0.0'), Decimal('0.5'), Decimal('3.5'), Decimal('96.0')),
 ('tunisia', Decimal('0.0'), Decimal('94.2'), Decimal('1.8'), Decimal('0.0'), Decimal('0.3'), Decimal('2.8'), Decimal('96.0')),
 ('iraq', Decimal('0.0'), Decimal('21.9'), Decimal('73.7'), Decimal('0.0'), Decimal('4.3'), Decimal('0.0'), Decimal('95.6')),
 ('azerbaijan', Decimal('0.0'), Decimal('93.9'), Decimal('0.2'), Decimal('0.0'), Decimal('5.3'), Decimal('0.4'), Decimal('94.1')),
 ('moldova', Decimal('0.0'), Decimal('93.5'), Decimal('0.3'), Decimal('0.0'), Decimal('5.9'), Decimal('0.3'), Decimal('93.8')),
 ('iran, islamic rep.', Decimal('0.2'), Decimal('71.3'), Decimal('21.7'), Decimal('1.6'), Decimal('5.0'), Decimal('0.1'), Decimal('93.2')),
 ('south africa', Decimal('93.0'), Decimal('0.0'), Decimal('0.1'), Decimal('5.5'), Decimal('0.4'), Decimal('1.0'), Decimal('93.1')),
 ('cyprus', Decimal('0.0'), Decimal('0.0'), Decimal('92.7'), Decimal('0.0'), Decimal('0.0'), Decimal('7.3'), Decimal('92.7')),
 ('kazakhstan', Decimal('71.9'), Decimal('19.2'), Decimal('1.0'), Decimal('0.0'), Decimal('7.9'), Decimal('0.0'), Decimal('92.1')),
 ('haiti', Decimal('0.0'), Decimal('0.0'), Decimal('91.3'), Decimal('0.0'), Decimal('8.7'), Decimal('0.0'), Decimal('91.3')),
 ('egypt, arab rep.', Decimal('0.0'), Decimal('78.7'), Decimal('12.2'), Decimal('0.0'), Decimal('8.1'), Decimal('0.9'), Decimal('90.9')),
 ('thailand', Decimal('21.6'), Decimal('68.3'), Decimal('1.0'), Decimal('0.0'), Decimal('3.2'), Decimal('5.9'), Decimal('90.9')),
 ('malaysia', Decimal('37.9'), Decimal('50.1'), Decimal('2.4'), Decimal('0.0'), Decimal('9.1'), Decimal('0.6'), Decimal('90.4')),
 ('jamaica', Decimal('0.0'), Decimal('0.0'), Decimal('90.2'), Decimal('0.0'), Decimal('3.3'), Decimal('6.5'), Decimal('90.2')),
 ('indonesia', Decimal('52.6'), Decimal('24.6'), Decimal('11.3'), Decimal('0.0'), Decimal('6.6'), Decimal('4.8'), Decimal('88.5')),
 ('estonia', Decimal('87.4'), Decimal('0.6'), Decimal('0.3'), Decimal('0.0'), Decimal('0.2'), Decimal('10.9'), Decimal('88.3')),
 ('senegal', Decimal('0.0'), Decimal('4.2'), Decimal('83.6'), Decimal('0.0'), Decimal('8.7'), Decimal('1.8'), Decimal('87.8')),
 ('morocco', Decimal('55.0'), Decimal('19.5'), Decimal('13.1'), Decimal('0.0'), Decimal('5.7'), Decimal('6.7'), Decimal('87.6')),
 ('poland', Decimal('83.0'), Decimal('3.4'), Decimal('1.0'), Decimal('0.0'), Decimal('1.4'), Decimal('11.1'), Decimal('87.4')),
 ('dominican republic', Decimal('13.3'), Decimal('21.5'), Decimal('51.9'), Decimal('0.0'), Decimal('8.5'), Decimal('4.7'), Decimal('86.7')),
 ('syrian arab republic', Decimal('0.0'), Decimal('64.4'), Decimal('21.8'), Decimal('0.0'), Decimal('13.8'), Decimal('0.0'), Decimal('86.2')),
 ('japan', Decimal('33.7'), Decimal('40.6'), Decimal('11.2'), Decimal('0.0'), Decimal('7.9'), Decimal('6.1'), Decimal('85.5')),
 ('australia', Decimal('61.2'), Decimal('21.9'), Decimal('2.0'), Decimal('0.0'), Decimal('7.4'), Decimal('7.5'), Decimal('85.1')),
 ('netherlands', Decimal('31.3'), Decimal('49.8'), Decimal('1.8'), Decimal('4.0'), Decimal('0.1'), Decimal('11.2'), Decimal('82.9')),
 ('nigeria', Decimal('0.0'), Decimal('82.4'), Decimal('0.0'), Decimal('0.0'), Decimal('17.6'), Decimal('0.0'), Decimal('82.4')),
 ('india', Decimal('75.1'), Decimal('4.9'), Decimal('1.8'), Decimal('2.8'), Decimal('10.2'), Decimal('5.2'), Decimal('81.8')),
 ('mauritius', Decimal('42.9'), Decimal('0.0'), Decimal('36.7'), Decimal('0.0'), Decimal('3.1'), Decimal('17.2'), Decimal('79.6')),
 ('mexico', Decimal('11.2'), Decimal('57.0'), Decimal('10.9'), Decimal('3.2'), Decimal('12.9'), Decimal('4.6'), Decimal('79.1')),
 ('turkey', Decimal('30.3'), Decimal('47.9'), Decimal('0.9'), Decimal('0.0'), Decimal('16.1'), Decimal('4.8'), Decimal('79.1')),
 ('uzbekistan', Decimal('4.1'), Decimal('74.2'), Decimal('0.4'), Decimal('0.0'), Decimal('21.4'), Decimal('0.0'), Decimal('78.7')),
 ('luxembourg', Decimal('0.0'), Decimal('76.2'), Decimal('0.0'), Decimal('0.0'), Decimal('5.7'), Decimal('15.3'), Decimal('76.2')),
 ('macedonia, fyr', Decimal('69.5'), Decimal('3.6'), Decimal('2.8'), Decimal('0.0'), Decimal('22.5'), Decimal('1.6'), Decimal('75.9')),
 ('greece', Decimal('51.1'), Decimal('13.5'), Decimal('11.0'), Decimal('0.0'), Decimal('8.9'), Decimal('15.3'), Decimal('75.6')),
 ('ireland', Decimal('24.9'), Decimal('49.6'), Decimal('0.7'), Decimal('0.0'), Decimal('2.7'), Decimal('21.8'), Decimal('75.2')),
 ('china', Decimal('72.6'), Decimal('2.0'), Decimal('0.2'), Decimal('2.3'), Decimal('18.6'), Decimal('4.1'), Decimal('74.8')),
 ('philippines', Decimal('42.8'), Decimal('24.2'), Decimal('7.4'), Decimal('0.0'), Decimal('11.8'), Decimal('13.8'), Decimal('74.4')),
 ('bolivia', Decimal('0.0'), Decimal('70.0'), Decimal('2.0'), Decimal('0.0'), Decimal('25.7'), Decimal('2.3'), Decimal('72.0')),
 ('korea, rep.', Decimal('42.4'), Decimal('23.9'), Decimal('3.2'), Decimal('28.7'), Decimal('0.5'), Decimal('1.1'), Decimal('69.5')),
 ('united states', Decimal('39.7'), Decimal('26.9'), Decimal('0.9'), Decimal('19.2'), Decimal('6.1'), Decimal('6.9'), Decimal('67.5')),
 ('serbia', Decimal('66.3'), Decimal('0.7'), Decimal('0.0'), Decimal('0.0'), Decimal('32.9'), Decimal('0.1'), Decimal('67.0')),
 ('russian federation', Decimal('14.9'), Decimal('50.2'), Decimal('1.0'), Decimal('17.0'), Decimal('16.5'), Decimal('0.1'), Decimal('66.1'))]

**Distribution mondiale des mix energétiques de pays**

In [41]:
%%sql
SELECT
*
FROM country
WHERE coal >= 66 
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:65432/postgres
13 rows affected.

[('kosovo', Decimal('96.9'), Decimal('0.0'), Decimal('0.3'), Decimal('2.8'), Decimal('0.0'), Decimal('0.0')),
 ('botswana', Decimal('95.8'), Decimal('0.0'), Decimal('4.2'), Decimal('0.0'), Decimal('0.0'), Decimal('0.0')),
 ('south africa', Decimal('93.0'), Decimal('0.0'), Decimal('0.1'), Decimal('0.4'), Decimal('1.0'), Decimal('5.5')),
 ('mongolia', Decimal('92.3'), Decimal('0.0'), Decimal('4.5'), Decimal('0.0'), Decimal('3.2'), Decimal('0.0')),
 ('estonia', Decimal('87.4'), Decimal('0.6'), Decimal('0.3'), Decimal('0.2'), Decimal('10.9'), Decimal('0.0')),
 ('poland', Decimal('83.0'), Decimal('3.4'), Decimal('1.0'), Decimal('1.4'), Decimal('11.1'), Decimal('0.0')),
 ('hong kong sar, china', Decimal('76.2'), Decimal('23.0'), Decimal('0.6'), Decimal('0.0'), Decimal('0.2'), Decimal('0.0')),
 ('india', Decimal('75.1'), Decimal('4.9'), Decimal('1.8'), Decimal('10.2'), Decimal('5.2'), Decimal('2.8')),
 ('china', Decimal('72.6'), Decimal('2.0'), Decimal('0.2'), Decimal('18.6'), Decimal('4.1'), Decimal('2.3')),
 ('kazakhstan', Decimal('71.9'), Decimal('19.2'), Decimal('1.0'), Decimal('7.9'), Decimal('0.0'), Decimal('0.0')),
 ('niger', Decimal('71.6'), Decimal('0.0'), Decimal('27.8'), Decimal('0.0'), Decimal('0.6'), Decimal('0.0')),
 ('macedonia, fyr', Decimal('69.5'), Decimal('3.6'), Decimal('2.8'), Decimal('22.5'), Decimal('1.6'), Decimal('0.0')),
 ('serbia', Decimal('66.3'), Decimal('0.7'), Decimal('0.0'), Decimal('32.9'), Decimal('0.1'), Decimal('0.0'))]

In [42]:
%%sql
SELECT
*
FROM country
WHERE renewable >= 33
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('denmark', Decimal('34.4'), Decimal('6.5'), Decimal('1.0'), Decimal('0.0'), Decimal('55.8'), Decimal('0.0')),
 ('kenya', Decimal('0.0'), Decimal('0.0'), Decimal('18.5'), Decimal('35.8'), Decimal('45.7'), Decimal('0.0')),
 ('nicaragua', Decimal('0.0'), Decimal('0.0'), Decimal('46.1'), Decimal('8.9'), Decimal('45.0'), Decimal('0.0'))]

In [43]:
%%sql
SELECT
*
FROM country
WHERE nuclear >= 50

 * postgresql://postgres:***@localhost:65432/postgres
3 rows affected.

[('france', Decimal('2.2'), Decimal('2.3'), Decimal('0.3'), Decimal('11.3'), Decimal('5.1'), Decimal('78.4')),
 ('hungary', Decimal('20.8'), Decimal('14.4'), Decimal('0.2'), Decimal('1.0'), Decimal('9.7'), Decimal('53.3')),
 ('slovak republic', Decimal('12.4'), Decimal('6.0'), Decimal('1.1'), Decimal('15.5'), Decimal('7.4'), Decimal('57.1'))]

## Synthèse des observations sur la répartition mondiale des sources d’énergie électrique

### Vue d’ensemble mondiale

* Les énergies fossiles (pétrole, gaz, charbon) représentent 67 % de la production mondiale d’électricité.
* Les énergies dites propres (nucléaire, hydraulique, renouvelables) représentent seulement 33 %.
* Certaines régions atteignent des niveaux extrêmes : 96 % d’énergies fossiles pour seulement 4 % d’énergies propres.

### Analyse par régions

* L’énergie hydraulique constitue la principale composante des énergies propres dans la plupart des régions.
* L’Amérique latine est la région la moins dépendante des énergies fossiles (45 %), grâce à son importante production hydraulique.
* Trois régions utilisent encore le charbon à plus de 50 % dans leur mix électrique.
* En Amérique du Nord, le charbon représente encore 35 % de la production.
* L’Europe est la seule région ayant développé à la fois :

  * le nucléaire (22,4 %),
  * les énergies renouvelables (10,5 %).
    → Ensemble, ces deux sources ne couvrent néanmoins qu’un tiers du mix énergétique européen.

### Analyse par pays

* Grâce à l’hydroélectricité, 34 pays atteignent plus de 66 % d’énergies propres dans leur mix électrique.
* À l’opposé, 69 pays utilisent plus de 66 % d’énergies fossiles.
* Plus de 13 pays produisent plus des deux tiers de leur électricité à partir du charbon, notamment :

  * Chine : 73 %,
  * Inde : 75 %.
* Certains pays cumulant pourtant de fortes parts de renouvelables restent encore dépendants du charbon :

  * Exemple : Danemark, 56 % renouvelables mais 34 % charbon.
* Quelques exceptions notables :

  * France : 78 % d’électricité produite grâce au nucléaire.
  * Kenya : environ 90 % issus de l’hydraulique et des renouvelables.

## Calculateur de CO2
### Création de la table energy_emission_factors

In [44]:
%%sql

DROP TABLE IF EXISTS energy_emission_factors;

CREATE TABLE energy_emission_factors (
    energy_source TEXT PRIMARY KEY,
    min_gco2_kwh NUMERIC,
    median_gco2_kwh NUMERIC,
    max_gco2_kwh NUMERIC
);

 * postgresql://postgres:***@localhost:65432/postgres
Done.
Done.

[]

### Alimentation de la table avec les données fournies

In [45]:
%%sql

INSERT INTO energy_emission_factors VALUES
('coal',       740, 820, 910),
('gas',        410, 490, 650),
('oil',        620, 740, 890),
('hydro',        1,  24, 2200),
('solar',       26,  41,  60),
('nuclear',    3.7,  12, 110);

 * postgresql://postgres:***@localhost:65432/postgres
6 rows affected.

[]

In [46]:
%%sql
SELECT *
FROM energy_emission_factors

 * postgresql://postgres:***@localhost:65432/postgres
6 rows affected.

[('coal', Decimal('740'), Decimal('820'), Decimal('910')),
 ('gas', Decimal('410'), Decimal('490'), Decimal('650')),
 ('oil', Decimal('620'), Decimal('740'), Decimal('890')),
 ('hydro', Decimal('1'), Decimal('24'), Decimal('2200')),
 ('solar', Decimal('26'), Decimal('41'), Decimal('60')),
 ('nuclear', Decimal('3.7'), Decimal('12'), Decimal('110'))]

### Observation – Valeur maximale des émissions pour l’hydroélectricité

La valeur maximale parfois citée pour l’hydroélectricité (jusqu’à ~2200 gCO₂e/kWh) correspond à des **cas extrêmes et rares**, principalement liés à des barrages tropicaux où la décomposition de la biomasse inondée génère d’importantes émissions de méthane (CH₄).  
Cette valeur ne reflète **pas une situation représentative** de la majorité des installations hydroélectriques. Dans ce projet, la **valeur médiane (24 gCO₂e/kWh)** est donc privilégiée comme référence, et la borne maximale est laissée non définie afin d’éviter un biais dans l’analyse.